In [ ]:
# Link to API
http://api.open-notify.org/astros.json

In [1]:
# Get the resopnse from teh API endpoint
import requests

# Make API call
response = requests.get("http://api.open-notify.org/astros.json")

# Instantiate the call to a object called "data"
data = response.json()

In [2]:
data

{'message': 'success',
 'people': [{'name': 'Alexey Ovchinin', 'craft': 'ISS'},
  {'name': 'Nick Hague', 'craft': 'ISS'},
  {'name': 'Christina Koch', 'craft': 'ISS'},
  {'name': 'Alexander Skvortsov', 'craft': 'ISS'},
  {'name': 'Luca Parmitano', 'craft': 'ISS'},
  {'name': 'Andrew Morgan', 'craft': 'ISS'}],
 'number': 6}

In [10]:
import pandas as pd
from pandas.io.json import json_normalize

df = pd.DataFrame.from_dict(data, orient='columns')

In [11]:
df

   message                                           people  number
0  success      {'name': 'Alexey Ovchinin', 'craft': 'ISS'}       6
1  success           {'name': 'Nick Hague', 'craft': 'ISS'}       6
2  success       {'name': 'Christina Koch', 'craft': 'ISS'}       6
3  success  {'name': 'Alexander Skvortsov', 'craft': 'ISS'}       6
4  success       {'name': 'Luca Parmitano', 'craft': 'ISS'}       6
5  success        {'name': 'Andrew Morgan', 'craft': 'ISS'}       6

In [13]:
pd.concat([df.drop(['people'], axis=1), df['people'].apply(pd.Series)], axis=1)

   message  number                 name craft
0  success       6      Alexey Ovchinin   ISS
1  success       6           Nick Hague   ISS
2  success       6       Christina Koch   ISS
3  success       6  Alexander Skvortsov   ISS
4  success       6       Luca Parmitano   ISS
5  success       6        Andrew Morgan   ISS

In [14]:
df.to_csv('ISS_people.csv')